pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
/**************************************************************************//**
 * @file      rtl8710c_syson_type.h
 * @brief
 * @version   V1.00
 * @date      2019-4-26 20:0:29
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * 
 ******************************************************************************/

#ifndef _RTL8710C_SYSON_SYSON_TYPE_H_
#define _RTL8710C_SYSON_SYSON_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SYSON_REG_TYPE

/**
 * @addtogroup hs_hal_syson_reg SYSON Register Type.
 * @ingroup hs_hal_syson
 * @{
 */

/**
  \brief Union type to access syson_sys_pwr_iso_ctrl (@ 0x00000000).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000000) System Power and Isolation Control Register                */
  
  struct {
    __IM  uint32_t            : 8;
    __IOM uint32_t pon_spc_en : 1;            /*!< [8..8] 1:enable peripheral on domain small power cut                      */
    __IOM uint32_t pon_lpc_en : 1;            /*!< [9..9] 1:enable peripheral on domain large power cut                      */
    __IOM uint32_t soc_spc_en : 1;            /*!< [10..10] 1:enable SOC domain small power cut                              */
    __IOM uint32_t soc_lpc_en : 1;            /*!< [11..11] 1:enable SOC domain large power cut                              */
    __IM  uint32_t            : 4;
    __IOM uint32_t sys_iso_peon : 1;          /*!< [16..16] description                                                      */
    __IOM uint32_t sys_iso_ret_mem : 1;       /*!< [17..17] 1: isolation retention memroy to SOC domain; 0: disable
                                                   isolation                                                                 */
    __IOM uint32_t sys_iso_soc : 1;           /*!< [18..18] 1: isolation SOC to PEON domain; 0: disable isolation            */
    __IM  uint32_t            : 2;
    __IOM uint32_t sys_iso_128k_osc : 1;      /*!< [21..21] 1: isolation 128K NCO's input signal to syson; 0:disable
                                                   isolation                                                                 */
    __IOM uint32_t sys_iso_xtal : 1;          /*!< [22..22] 1: isolatino XTAL to SYSON; 0: disable isolation                 */
    __IOM uint32_t sys_iso_syspll : 1;        /*!< [23..23] 1: isolatino SYSPLL to SYSON; 0: disable isolation               */
  } b;                                        /*!< bit fields for syson_sys_pwr_iso_ctrl */
} syson_sys_pwr_iso_ctrl_t, *psyson_sys_pwr_iso_ctrl_t;

/**
  \brief Union type to access syson_sys_func_en (@ 0x00000008).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000008) System Function Control Register                           */
  
  struct {
    __IOM uint32_t sys_fen_eeldr : 1;         /*!< [0..0] 1: enable EE Loader; 0: disable EE loader                          */
    __IM  uint32_t            : 3;
    __IOM uint32_t soc_syspeon_en : 1;        /*!< [4..4] 1: enable SYSTEM to APB0                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t lp_timer_en : 1;           /*!< [6..6] 1: enable Lptimer                                                  */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpio_en    : 1;            /*!< [8..8] 1: enable GPIO macro                                               */
    __IOM uint32_t gpio_rst_mux : 1;          /*!< [9..9] 1: Mask WDOG_RST to reset GPIO block                               */
    __IM  uint32_t            : 14;
    __IOM uint32_t sys_fen_sic : 1;           /*!< [24..24] 1: enable SIC function enable; 0: reset                          */
    __IOM uint32_t sys_fen_sic_mst : 1;       /*!< [25..25] 1: enable SIC to access register by CPU                          */
    __IM  uint32_t            : 5;
    __IOM uint32_t sys_amacro_en : 1;         /*!< [31..31] Analog IP PWD_B, REGU hw_pdb_12                                  */
  } b;                                        /*!< bit fields for syson_sys_func_en */
} syson_sys_func_en_t, *psyson_sys_func_en_t;

/**
  \brief Union type to access syson_sys_clk_ctrl0 (@ 0x00000010).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000010) System Clock Control Register0                             */
  
  struct {
    __IOM uint32_t syson_ck_sysreg_en : 1;    /*!< [0..0] 1: Enable SYSON register clock; 0: gated SYSON Register
                                                   clock                                                                     */
    __IOM uint32_t syson_ck_eeldr_en : 1;     /*!< [1..1] 1: enable EE LDR clock; 0: gated EE LDR clock                      */
    __IOM uint32_t soc_ocp_iobus_ck_en : 1;   /*!< [2..2] 1: enable to generate CPU/BUS clock from PLL clock                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t lp_timer_sclk_en : 1;      /*!< [4..4] 1: enable LP timer 32K clk                                         */
    __IOM uint32_t lp_timer_pclk_en : 1;      /*!< [5..5] 1: enable LP timer pclk                                            */
    __IOM uint32_t lp_timer_intclk_sel : 1;   /*!< [6..6] 1: 32k; 0: pclk                                                    */
    __IM  uint32_t            : 1;
    __IOM uint32_t soc_dbclk_gpio_en : 1;     /*!< [8..8] 1: enable gpio db32 clock                                          */
    __IOM uint32_t soc_pclk_gpio_en : 1;      /*!< [9..9] 1: enable gpio pclock                                              */
    __IOM uint32_t soc_intclk_gpio_sel : 1;   /*!< [10..10] 0: apb clk; 1 debounce clk                                       */
  } b;                                        /*!< bit fields for syson_sys_clk_ctrl0 */
} syson_sys_clk_ctrl0_t, *psyson_sys_clk_ctrl0_t;

/**
  \brief Union type to access syson_sys_clk_ctrl1 (@ 0x00000014).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000014) System Clock Control Register1                             */
  
