pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t pesoc_eeldr_ck_sel : 1;    /*!< [0..0] 1: 4Mhz divide by 16, 0: 4Mhz                                      */
    __IM  uint32_t            : 7;
    __IOM uint32_t extclk_32k : 1;            /*!< [8..8] 1: use external 32k; 0: use internal 32k                           */
  } b;                                        /*!< bit fields for syson_sys_clk_ctrl1 */
} syson_sys_clk_ctrl1_t, *psyson_sys_clk_ctrl1_t;

/**
  \brief Union type to access syson_sys_efuse_syscfg0 (@ 0x00000020).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000020) System Configuration eFuse Load Register0                  */
  
  struct {
    __IOM uint32_t secure_efuse_reg_check_dis : 1;/*!< [0..0] 1: Disable secure register check (Default). 0: Enable
                                                   secure register check. This register just can be written
                                                   once. After that, hardware will disable the writing function.             */
    __IOM uint32_t sic_secure_dis : 1;        /*!< [1..1] 1: Enable that SIC is secure mode (Default). 0: Disable
                                                   that SIC is secure mode. This register just can be written
                                                   once. After that, hardware will disable the writing function.             */
    __IOM uint32_t secure_jtag_swd_mode : 2;  /*!< [3..2] 3 or 2: Enable secure world JTAG/SWD (Default). 1: Enable
                                                   password secure world JTAG/SWD. 0: disable secure world
                                                   JTAG/SWD. This register just can be written once. After
                                                   that, hardware will disable the writing function.                         */
    __IOM uint32_t non_secure_jtag_swd_mode : 2;/*!< [5..4] 3 or 2: Enable non-secure world JTAG/SWD (Default). 1:
                                                   Enable password non-secure world JTAG/SWD. 0: disable non-secure
                                                   world JTAG/SWD. This register just can be written once.
                                                   After that, hardware will disable the writing function.                   */
    __IOM uint32_t fixed_key_dis : 1;         /*!< [6..6] 0: DAP Protection IP cannot request Efuse Key Control
                                                   to read the efuse key. The key will be stored into register.
                                                   The length of key: 256 bits. 1: DAP Protection IP can request
                                                   Efuse Key Control to read the efuse key. The length of
                                                   key: 128 bits. This register just can be written once.
                                                   After that, hardware will disable the writing function.                   */
    __IM  uint32_t            : 9;
    __IOM uint32_t efuse_id0  : 8;            /*!< [23..16] Efuse ID byte0, expect ID: 0x10                                  */
    __IOM uint32_t efuse_id1  : 8;            /*!< [31..24] Efuse ID byte1, expect ID: 0x87                                  */
  } b;                                        /*!< bit fields for syson_sys_efuse_syscfg0 */
} syson_sys_efuse_syscfg0_t, *psyson_sys_efuse_syscfg0_t;

/**
  \brief Union type to access syson_sys_efuse_syscfg1 (@ 0x00000024).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000024) System Configuration eFuse Load Register1                  */
  
  struct {
    __IOM uint32_t sys_regu_par_03_00_ldoaon_adj : 4;/*!< [3..0] LDOH12 voltage select Digital LDO voltage 0000: 0.600V
                                                   0001: 0.631V 0010: 0.660V 0011: 0.692V 0100: 0.719V 0101:
                                                   0.749V 0110: 0.782V 0111: 0.817V 1000: 0.856V 1001: 0.899V
                                                   1010: 0.952V 1011: 0.998V 1100: 1.049V 1101: 1.096V 1110:
                                                   1.149V 1111: 1.196V                                                       */
    __IOM uint32_t sys_regu_par_08_05_ldo25e_adj : 4;/*!< [7..4] LDOE25 voltage select 0000: 3.30V 0001: 3.27V 0010: 3.05V
                                                   0011: 2.86V 0100: 2.69V 0101: 2.54V 0110: 2.4V 0111: 2.28V
                                                   1000: 2.17V 1001: 2.07V 1010: 1.98V 1011: 1.89V 1100: 1.82V
                                                   1101: 1.74V 1110: 1.68V 1111: 1.62V                                       */
    __IOM uint32_t sys_regu_bod_th_sel : 4;   /*!< [11..8] 0000:0.5V 0001:2.6V 0010:2.65V 0011:2.7V 0100:2.75V
                                                   0101:2.8V 0110:2.85V 0111:2.9V 1000:2.95V 1001:3V Others:NONE             */
    __IOM uint32_t sys_vbat_sel : 2;          /*!< [13..12] 00:3.4V 01:3.3V default 10:3.2V 11:3.1V                          */
    __IM  uint32_t            : 2;
    __IOM uint32_t sys_swr12_vol : 4;         /*!< [19..16] SWR/LDO 0000 0.965 0001 1.000 0010 1.037 0011 1.078
                                                   0100 1.100 0101 1.122 0110 1.146 0111 1.170 1000 1.196
                                                   1001 1.222 1010 1.250 1011 1.279 1100 1.310 1101 1.341
                                                   1110 1.375 1111 1.410                                                     */
    __IOM uint32_t sys_swr12_std : 2;         /*!< [21..20] STD_L1<1:0> time 00 96us 01 192us 10 768us 11 3.072ms            */
    __IOM uint32_t sys_swr12_in : 3;          /*!< [24..22] IN_L1<2:0> output 000 0.425 001 0.450 010 0.475 011
                                                   0.500 100 0.525 101 0.550 110 0.575 111 0.600                             */
    __IOM uint32_t sys_spsldo_vol : 3;        /*!< [27..25] <44> <11:9> LDO 0 000 0.600 0 001 0.631 0 010 0.660
                                                   0 011 0.692 0 100 0.719 0 101 0.749 0 110 0.782 0 111 0.817
                                                   1 000 0.856 1 001 0.899 1 010 0.952 1 011 0.998 1 100 1.049
                                                   1 101 1.096 1 110 1.149 1 111 1.196                                       */
    __IOM uint32_t sys_swr12_fpwm_md : 1;     /*!< [28..28] reg_auto_L=0 FPWM_L1 = 1 => force PWM FPWM_L1 = 0 =>
                                                   force PFM                                                                 */
    __IOM uint32_t sys_swr12_ocp_en : 1;      /*!< [29..29] 1: enable over current protection                                */
    __IOM uint32_t sys_swr12_pow_zcd : 1;     /*!< [30..30] Enable ZCD                                                       */
    __IOM uint32_t sys_sw12_auto_mode : 1;    /*!< [31..31] 0:force PWM or PFM 1:auto                                        */
  } b;                                        /*!< bit fields for syson_sys_efuse_syscfg1 */
} syson_sys_efuse_syscfg1_t, *psyson_sys_efuse_syscfg1_t;

/**
  \brief Union type to access syson_sys_efuse_syscfg2 (@ 0x00000028).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000028) System Configuration eFuse Load Register2                  */
  
