pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t sys_xtal_sc_xi : 7;        /*!< [6..0] 1:add cap, 0:degrade cap. (200fF per unit)                         */
    __IOM uint32_t sys_xtal_sc_xo : 7;        /*!< [13..7] 1:add cap, 0:degrade cap. (200fF per unit)                        */
    __IOM uint32_t xtal_xoxi_cfix : 1;        /*!< [14..14] 1: turn XOXI Cfix single side 6.6pF                              */
    __IOM uint32_t xtal_ck_sel : 3;           /*!< [17..15] aac settling cycles (4M ring) 000: 2^8 100: 2^12 001:
                                                   2^9 101: 2^13 010: 2^10 110: 2^ 14 011: 2^11 (512us / for
                                                   4MHz) 111: 2^15                                                           */
    __IOM uint32_t xtal_aac_en : 1;           /*!< [18..18] 1:enable aac digital circuit                                     */
    __IOM uint32_t pk_start_ar : 2;           /*!< [20..19] AACK peak sel start (star>end)                                   */
    __IOM uint32_t pk_end_ar  : 2;            /*!< [22..21] AACK peak sel end (star>end)                                     */
    __IOM uint32_t sw_rsvd    : 9;            /*!< [31..23] Reserved for software                                            */
  } b;                                        /*!< bit fields for syson_sys_efuse_syscfg2 */
} syson_sys_efuse_syscfg2_t, *psyson_sys_efuse_syscfg2_t;

/**
  \brief Union type to access syson_sys_efuse_syscfg3 (@ 0x0000002C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000002C) System Configuration eFuse Load Register3                  */
  
  struct {
    __IOM uint32_t pll_enc_c3_set : 2;        /*!< [1..0] Cp selection. Default=5p 00: Cp=3p, 01: Cp=4p, 10: Cp=5p,
                                                   11: Cp=6p                                                                 */
    __IOM uint32_t pll_enc_r3_sel : 3;        /*!< [4..2] R3 selection. Default=1k 000: R3=0k, 001: R3=0.5k, 010:
                                                   R3=1k, 011: R3=1.5k, 100: R3=2k, 101: R3=2.5k, 110: R3=3k,
                                                   111: R3=3.5k;                                                             */
    __IOM uint32_t pll_enc_cs_sel : 2;        /*!< [6..5] Cs selection. Default=50p 00: Cs=30p, 01: Cs=40p, 10:
                                                   Cs=50p, 11: Cs=60p                                                        */
    __IOM uint32_t pll_enc_rs_sel : 3;        /*!< [9..7] Rs selection. Default=14k 000: Rs=2k, 001: Rs=4k, 010:
                                                   Rs=6k, 011: Rs=8k, 100: Rs=10k, 101: Rs=12k, 110: Rs=14k,
                                                   111: Rs=16k;                                                              */
    __IOM uint32_t pll_enc_cp_sel : 2;        /*!< [11..10] Cp selection. Default=3p 00: Cp=3p, 01: Cp=4p, 10:
                                                   Cp=5p, 11: Cp=6p                                                          */
    __IOM uint32_t pll_enc_cpc_sel : 3;       /*!< [14..12] charge pump current selection . Default=5u CP current
                                                   select : 000: Icp=5uA, 001: Icp=10uA, 010: Icp=15uA, 011:
                                                   Icp=20uA; 100:Icp=25uA, 101: Icp=30uA, 110: Icp=35uA, 111:
                                                   Icp=40uA;                                                                 */
    __IOM uint32_t xtal_sel   : 1;            /*!< [15..15] Indicate xtal frequency 0: 40MHz ==> PLL1[31:28] =
                                                   4'b0000 1: 26Mhz ==> PLL1[31:28] = 4'b 0101                               */
    __IOM uint32_t pll_enc_ref_clk_sel : 1;   /*!< [16..16] 0-> select special route , 1-> digital APR                       */
    __IOM uint32_t pll_enc_sp_r_enb : 1;      /*!< [17..17] 0-> enable special route ,1-> disable special route              */
    __IOM uint32_t sw_rsvd    : 14;           /*!< [31..18] Reserved for software                                            */
  } b;                                        /*!< bit fields for syson_sys_efuse_syscfg3 */
} syson_sys_efuse_syscfg3_t, *psyson_sys_efuse_syscfg3_t;

/**
  \brief Union type to access syson_sys_efuse_syscfg4 (@ 0x00000030).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000030) System Configuration eFuse Load Register4                  */
  
  struct {
    __IOM uint32_t debug_port_select : 8;     /*!< [7..0] Debug port select                                                  */
    __IOM uint32_t dbgio_groupa_enable : 1;   /*!< [8..8] enable debug IO[3:0] A0, A1, A13, A14                              */
    __IOM uint32_t dbgio_groupb_enable : 1;   /*!< [9..9] enable debug IO[7:4] A15, A16, A7, A8                              */
    __IOM uint32_t dbgio_groupc_enable : 1;   /*!< [10..10] enable debug IO[11:8] A10, A11, A2, A3                           */
    __IOM uint32_t dbgio_groupd_enable : 1;   /*!< [11..11] enable debug IO[15:12] A9, A12, A21, A22                         */
    __IM  uint32_t            : 4;
    __IOM uint32_t dbgio_a_signal_sel : 4;    /*!< [19..16] 0000: DBG[3:0] 0001: DBG[7:4] 0010: DBG[11:8] 0011:
                                                   DBG[15:12] 0100: DBG[19:16] 0101: DBG[23:20] 0110: DBG[27:24]
                                                   0111: DBG[31:28]                                                          */
    __IOM uint32_t dbgio_b_signal_sel : 4;    /*!< [23..20] 0000: DBG[3:0] 0001: DBG[7:4] 0010: DBG[11:8] 0011:
                                                   DBG[15:12] 0100: DBG[19:16] 0101: DBG[23:20] 0110: DBG[27:24]
                                                   0111: DBG[31:28]                                                          */
    __IOM uint32_t dbgio_c_signal_sel : 4;    /*!< [27..24] 0000: DBG[3:0] 0001: DBG[7:4] 0010: DBG[11:8] 0011:
                                                   DBG[15:12] 0100: DBG[19:16] 0101: DBG[23:20] 0110: DBG[27:24]
                                                   0111: DBG[31:28]                                                          */
    __IOM uint32_t dbgio_d_signal_sel : 4;    /*!< [31..28] 0000: DBG[3:0] 0001: DBG[7:4] 0010: DBG[11:8] 0011:
                                                   DBG[15:12] 0100: DBG[19:16] 0101: DBG[23:20] 0110: DBG[27:24]
                                                   0111: DBG[31:28]                                                          */
  } b;                                        /*!< bit fields for syson_sys_efuse_syscfg4 */
} syson_sys_efuse_syscfg4_t, *psyson_sys_efuse_syscfg4_t;

/**
  \brief Union type to access syson_sys_regu_ctrl0 (@ 0x00000040).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000040) System Regulator Control Register0                         */
  
