pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t sys_regu_ldo25e_en : 1;    /*!< [0..0] 1: enable regulator LDO25E for Efuse programming                   */
    __IOM uint32_t sys_regu_pc_ef25_en : 1;   /*!< [1..1] 1: turn on power cut Efuse 25V                                     */
    __IM  uint32_t            : 16;
    __IOM uint32_t sys_regu_anack_4m_sel : 1; /*!< [18..18] 1: enable ANACK as 4MHz 0: enable ANACK output as 250KHz         */
    __IOM uint32_t sys_regu_anack_4m_en : 1;  /*!< [19..19] 1: enable ANACK 0: disable ANACK                                 */
  } b;                                        /*!< bit fields for syson_sys_regu_ctrl0 */
} syson_sys_regu_ctrl0_t, *psyson_sys_regu_ctrl0_t;

/**
  \brief Union type to access syson_sys_regu_ctrl1 (@ 0x00000044).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000044) System Regulator Control Register1                         */
  
  struct {
    __IM  uint32_t            : 10;
    __IOM uint32_t h5_mod_sel : 2;            /*!< [11..10] 11:Iq< 1uA, Iout = 0uA 01:Iq= 1uA, Iout = <10uA 00:Iq=
                                                   5uA, Iout = 1mA                                                           */
    __IM  uint32_t            : 2;
    __IOM uint32_t h5_diode_en : 1;           /*!< [14..14] Enable diode soft start                                          */
  } b;                                        /*!< bit fields for syson_sys_regu_ctrl1 */
} syson_sys_regu_ctrl1_t, *psyson_sys_regu_ctrl1_t;

/**
  \brief Union type to access syson_sys_swr_ctrl0 (@ 0x00000048).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000048) System Switching Regulator Control Register0               */
  
  struct {
    __IOM uint32_t sys_sldo_en : 1;           /*!< [0..0] 1: enable SLDO ; 0: disable SLDO                                   */
    __IOM uint32_t sys_swr_en : 1;            /*!< [1..1] 1: enable SWR regulator ; 0: disable SWR                           */
    __IOM uint32_t sys_swr_ldo_en : 1;        /*!< [2..2] 1: power on LDO                                                    */
    __IOM uint32_t sys_swr_diode_enb : 1;     /*!< [3..3] Enable diode soft start                                            */
    __IM  uint32_t            : 17;
    __IOM uint32_t sys_swr12_comp_type_l : 1; /*!< [21..21] Compensation L type: 1:type3 0:type2                             */
    __IOM uint32_t sys_swr12_comp_c1 : 2;     /*!< [23..22] 00 => 1.8p 01 => 3.6p 10 => 5.4p 11 => 7.2p                      */
    __IOM uint32_t sys_swr12_comp_c2 : 2;     /*!< [25..24] 00 => 35f 01 => 70f 10 => 70f 11 => 105f                         */
    __IOM uint32_t sys_swr12_comp_c3 : 2;     /*!< [27..26] 00 => 1.5p 01 => 3.0p 10 => 4.5p 11 => 6.0p                      */
    __IOM uint32_t sys_swr12_comp_r1 : 2;     /*!< [29..28] 00 => 600k 01 => 500k 10 => 700k 11 => 400k                      */
    __IOM uint32_t sys_swr12_comp_r2 : 2;     /*!< [31..30] 00 => 2.5M 01 => 2.0M 10 => 1.5M 11 => 1.0M                      */
  } b;                                        /*!< bit fields for syson_sys_swr_ctrl0 */
} syson_sys_swr_ctrl0_t, *psyson_sys_swr_ctrl0_t;

/**
  \brief Union type to access syson_sys_swr_ctrl1 (@ 0x0000004C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000004C) System Switching Regulator Control Register1               */
  
  struct {
    __IOM uint32_t sys_swr12_comp_r3 : 2;     /*!< [1..0] 00 => 1.2k 01 => 1.0k 10 => 1.0k 11 => 0.8k                        */
    __IOM uint32_t sys_swr12_sawtooth_cfc_l : 2;/*!< [3..2] Control sawtooth current for PFM Cap(pf) Ton(ns) 00 2.00
                                                   200 01 3.00 300 10 5.00 500 11 6.00 600                                   */
    __IOM uint32_t sys_swr12_sawtooth_cf_l : 2;/*!< [5..4] Control sawtooth capacitor COT Offset<1:0>                        */
    __IM  uint32_t            : 1;
    __IOM uint32_t sys_swr12_ocp_cur : 3;     /*!< [9..7] 000: Voltage 0.3; Current: 626mA 001: Voltage 0.4; Current:
                                                   8812mA 010: Voltage 0.5; Current: 998mA 011: Voltage 0.55;
                                                   Current: 1091mA 100: Voltage 0.6; Current: 1184mA 101:
                                                   Voltage 0.65; Current: 1276mA 110: Voltage 0.7; Current:
                                                   1396mA 111: Voltage 0.75; Current: 1462mA                                 */
    __IM  uint32_t            : 2;
    __IOM uint32_t sys_swr12_autozcd : 1;     /*!< [12..12] 0: zcd_code_in_L<4:0> 1:10000                                    */
    __IOM uint32_t sys_swr12_bypass_ssr : 1;  /*!< [13..13] 1: bypass SSR latch; 0: enable SSR latch                         */
    __IOM uint32_t sys_sw12_clamp_duty : 1;   /*!< [14..14] Clamp minimum duty                                               */
    __IOM uint32_t sys_sw12_nonovrlap_dly : 2;/*!< [16..15] Set nonoverlap delay                                             */
    __IOM uint32_t sys_sw12_tbox : 2;         /*!< [18..17] SWR DTEST_SWREG<0> 00 adv 01 n1_L 10 CKMOD 11 STOP_L
                                                   DTEST_SWREG<1> 00 ZCDon 01 VZCD 10 ckout 11 ocp                           */
    __IOM uint32_t sys_swr12_arenb : 1;       /*!< [19..19] 0:enable 1:disable                                               */
    __IOM uint32_t sys_sldo_cout_en : 1;      /*!< [20..20] Control small ldo voltage                                        */
    __IOM uint32_t sys_sw12_ocps_l : 1;       /*!< [21..21] when OCP enable PMOS or not 0:HG 1:PGATE                         */
    __IOM uint32_t sys_sw12_ldof_l : 1;       /*!< [22..22] SEL LDO mode feedback point 0:vo15 1:LX_SPS                      */
    __IM  uint32_t            : 2;
    __IOM uint32_t sys_sw12_zcd_cap_sel : 2;  /*!< [26..25] 00 60fF 01 60f+102f 10 60f+204f 11 60f+102f+204f                 */
    __IM  uint32_t            : 2;
    __IOM uint32_t en_max_duty : 1;           /*!< [29..29] Enable maximum duty                                              */
  } b;                                        /*!< bit fields for syson_sys_swr_ctrl1 */
} syson_sys_swr_ctrl1_t, *psyson_sys_swr_ctrl1_t;

/**
  \brief Union type to access syson_sys_swr_ocp (@ 0x00000058).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000058) System Switching Regulator Over Current Protection
                                                                  Control Register                                           */
  
