pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t sys_swr_ocp_wnd : 16;      /*!< [15..0] Over-current protect circuit window setting                       */
    __IOM uint32_t sys_swr_ocp_thd : 15;      /*!< [30..16] Over-current protect circuit threshold setting                   */
    __IOM uint32_t sys_swr_ocp_dis : 1;       /*!< [31..31] 1:Disable Over-current protect circuit; 0 : Enable               */
  } b;                                        /*!< bit fields for syson_sys_swr_ocp */
} syson_sys_swr_ocp_t, *psyson_sys_swr_ocp_t;

/**
  \brief Union type to access syson_sys_swr_zcd (@ 0x0000005C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000005C) System Switching Regulator Zero Current Detection
                                                                  Control Register                                           */
  
  struct {
    __IOM uint32_t sys_swr_zcd_code : 5;      /*!< [4..0] sys_swr_zcd_code                                                   */
    __IM  uint32_t            : 1;
    __IOM uint32_t sys_swr_zcd_mode : 1;      /*!< [6..6] sys_swr_zcd_mode                                                   */
    __IOM uint32_t sys_swr_zcd_auto : 1;      /*!< [7..7] sys_swr_zcd_auto                                                   */
  } b;                                        /*!< bit fields for syson_sys_swr_zcd */
} syson_sys_swr_zcd_t, *psyson_sys_swr_zcd_t;

/**
  \brief Union type to access syson_sys_xtal_ctrl0 (@ 0x00000060).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000060) System XTAL Control Register0                              */
  
  struct {
    __IOM uint32_t sys_xtal_bgmb_en : 1;      /*!< [0..0] 1: enable XTAL Bandgap and Mbias                                   */
    __IOM uint32_t sys_xtal_en : 1;           /*!< [1..1] 1: enable XTAL macro; 0: disable XTAL macro and no leakage
                                                   from XTAL block                                                           */
    __IM  uint32_t            : 6;
    __IOM uint32_t sys_xtal_gmp : 5;          /*!< [12..8] GMP: 0~31 + 1(fix)                                                */
    __IOM uint32_t sys_xtal_gmn : 5;          /*!< [17..13] GMP: 0~31 + 1(fix)                                               */
  } b;                                        /*!< bit fields for syson_sys_xtal_ctrl0 */
} syson_sys_xtal_ctrl0_t, *psyson_sys_xtal_ctrl0_t;

/**
  \brief Union type to access syson_sys_xtal_ctrl1 (@ 0x00000064).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000064) System XTAL Control Register1                              */
  
  struct {
    __IM  uint32_t            : 1;
    __IOM uint32_t gated_xtal_ok0 : 1;        /*!< [1..1] 1:Gated xtal OK0                                                   */
    __IOM uint32_t sys_xtal_xqsel_afe : 1;    /*!< [2..2] 0: self-bias buffer, 1:replica INV(for AFE)                        */
    __IOM uint32_t sys_xtal_ldo : 2;          /*!< [4..3] XTAL 1.2V LDO adjust (before Xtal start) 11: 1.3V 10:1.2V
                                                   01:1.1V 00:1.0V                                                           */
    __IOM uint32_t sys_xtal_gm_sep : 1;       /*!< [5..5] 0: GMP=GMN                                                         */
    __IOM uint32_t sys_xtal_gate_rf1p : 1;    /*!< [6..6] RF1P Clock source gated control, 1:gated, 0: clock enable          */
    __IOM uint32_t sys_xtal_gate_rf1n : 1;    /*!< [7..7] RF1N Clock source gated control, 1:gated, 0: clock enable          */
    __IOM uint32_t sys_xtal_drv_rf1 : 2;      /*!< [9..8] Driving control of RF1 clock buffer, 11:large current,
                                                   00: small current                                                         */
    __IOM uint32_t sys_xtal_gate_wlafep : 1;  /*!< [10..10] AFEP Clock source gated control, 1:gated, 0: clock
                                                   enable                                                                    */
    __IOM uint32_t sys_xtal_gate_wlafen : 1;  /*!< [11..11] AFE Clock source gated control, 1:gated, 0: clock enable         */
    __IOM uint32_t sys_xtal_drv_wlafe : 2;    /*!< [13..12] Driving control of WL AFE clock buffer, 11:large current,
                                                   00: small current                                                         */
    __IOM uint32_t sys_xtal_gate_usbn : 1;    /*!< [14..14] USBN Clock source gated control, 1:gated, 0: clock
                                                   enable                                                                    */
    __IOM uint32_t sys_xtal_gate_usbp : 1;    /*!< [15..15] USBP Clock source gated control, 1:gated, 0: clock
                                                   enable                                                                    */
    __IOM uint32_t sys_xtal_drv_usb : 2;      /*!< [17..16] Driving control of USB clock buffer, 11:large current,
                                                   00: small current                                                         */
    __IOM uint32_t sys_xtal_gate_digip : 1;   /*!< [18..18] SYSPLL Clock source gated control, 1:gated, 0: clock
                                                   enable                                                                    */
    __IOM uint32_t sys_xtal_gate_digin : 1;   /*!< [19..19] SYSPLL Clock source gated control, 1:gated, 0: clock
                                                   enable                                                                    */
    __IOM uint32_t sys_xtal_drv_digi : 2;     /*!< [21..20] Driving control of DIG clock buffer, 11:large current,
                                                   00: small current                                                         */
    __IOM uint32_t sys_xtal_ldo_ok : 2;       /*!< [23..22] (after Xtal started) 11: 1.3V 10:1.2V 01:1.1V 00:1.0V            */
    __IOM uint32_t sys_xtal_drv_rf_latch : 1; /*!< [24..24] 1: latch enable                                                  */
    __IOM uint32_t sys_xtal_delay_wlafe : 1;  /*!< [25..25] 1: ck delay by 3 inverters, 0: ck delay by 17 inverters          */
    __IOM uint32_t sys_xtal_delay_digi : 1;   /*!< [26..26] 1: ck delay by 3 inverters, 0: ck delay by half cycle            */
    __IOM uint32_t sys_xtal_delay_usb : 1;    /*!< [27..27] 1: ck delay by 3 inverters, 0: ck delay by 17 inverters          */
    __IOM uint32_t sys_xtal_xqsel_rf_initial : 1;/*!< [28..28] 0: schmitt trigger, 1:replica INV(for OK0=0)                  */
    __IOM uint32_t sys_xtal_xqsel_rf_awake : 1;/*!< [29..29] 0: self-bias buffer, 1:replica INV(for OK0=1)                   */
    __IOM uint32_t sys_xtal_ldo_di : 1;       /*!< [30..30] 1: enable LDO diode connect                                      */
    __IOM uint32_t sys_xtal_sel_tok_b0 : 1;   /*!< [31..31] bit_sys_xtal_sel_tok[0]                                          */
  } b;                                        /*!< bit fields for syson_sys_xtal_ctrl1 */
} syson_sys_xtal_ctrl1_t, *psyson_sys_xtal_ctrl1_t;

/**
  \brief Union type to access syson_sys_xtal_ctrl2 (@ 0x00000068).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000068) System XTAL Control Register2                              */
  
