pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t sys_xtal_sel_tok_b2_1 : 2; /*!< [1..0] For cycles / 40MHz / 26MHz 000: 8 / 200n / 300n 001:
                                                   16 / 400n / 600n 010: 32 / 800n / 1.2u 011: 64 / 1.6u /
                                                   2.5u 100: 2^14 / 0.4m / 0.6m 101: 2^15 / 0.8m / 1.2m 110:
                                                   2^16 / 1.6m / 2.5m 111: 2^17 / 3.2m / 4.9m                                */
    __IOM uint32_t sys_xtal_lpmode : 1;       /*!< [2..2] 1: xtal low power mode enable                                      */
    __IOM uint32_t sys_xtal_en_aac_gm : 1;    /*!< [3..3] 1: enable xtal aac gm control                                      */
    __IOM uint32_t sys_xtal_en_aac_peakdet : 1;/*!< [4..4] 1: enable xtal aac peak detector                                  */
    __IOM uint32_t sys_xtal_aack_pk_manu : 1; /*!< [5..5] 1: manual for peak detector peak selection                         */
    __IOM uint32_t sys_xtal_manu_pk_sel : 2;  /*!< [7..6] XI Vpk-to-Vpk 00: 0.7V 01: 0.8V 10: 0.9V 11: 1V                    */
    __IOM uint32_t sys_xtal_pk_sel_offset : 1;/*!< [8..8] 1: XI Vpk-to-Vpk offset to 00: 0.4V 01: 0.5V 10: 0.6V
                                                   11: 0.7V                                                                  */
    __IOM uint32_t sys_xtal_dummy : 6;        /*!< [14..9] Dummy control bits ( for Testing buf) <5:0>: reserved
                                                   <0>: 1: enable 1/2 VBG voltage to VBGO for CP testing                     */
    __IM  uint32_t            : 9;
    __IOM uint32_t xaac_reset_n : 1;          /*!< [24..24] AAC digital circuit reset (low to high)                          */
    __IOM uint32_t xaac_offset_plus : 1;      /*!< [25..25] 0: aac calibrated gm result - offset, 1:aac calibrated
                                                   gm result + offset                                                        */
    __IOM uint32_t xaac_gm_offset : 5;        /*!< [30..26] aac calibrated gm result +/- offset                              */
    __IOM uint32_t xaac_gm_step : 1;          /*!< [31..31] aac gm searching step. 0:step 1, 1:step 2                        */
  } b;                                        /*!< bit fields for syson_sys_xtal_ctrl2 */
} syson_sys_xtal_ctrl2_t, *psyson_sys_xtal_ctrl2_t;

/**
  \brief Union type to access syson_sys_xtal_aac_ctrl (@ 0x0000006C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000006C) System XTAL AAC Control Register                           */
  
  struct {
    __IOM uint32_t xaac_gm_init : 5;          /*!< [4..0] aac gm initial setting                                             */
    __IM  uint32_t            : 3;
    __IOM uint32_t xaac_gm_stup : 5;          /*!< [12..8] aac gm start up setting (when pkdet=0,gm trans to the
                                                   maximum value)                                                            */
    __IOM uint32_t xaac_manual : 5;           /*!< [17..13] Gm manual at EN_XTAL_AAC_DIGI=0                                  */
    __IOM uint32_t en_xtal_aac_digi : 1;      /*!< [18..18] 1:enable aac digital circuit                                     */
    __IM  uint32_t            : 1;
    __OM  uint32_t xaac_en_trig : 1;          /*!< [20..20] Enable main control statemachine to trigger auto enable
                                                   of AAC digital circuit                                                    */
    __IOM uint32_t xaac_mode  : 2;            /*!< [22..21] 11: XTAL_AACK_PK_SEL=<11>'s XTAL_GM_OUT3 10: XTAL_AACK_PK_SEL=<10>'s
                                                   XTAL_GM_OUT2 01: XTAL_AACK_PK_SEL=<01>'s XTAL_GM_OUT1 00:
                                                   XTAL_AACK_PK_SEL=<00>'s XTAL_GM_OUT0                                      */
    __IOM uint32_t xaac_lpow  : 1;            /*!< [23..23] xaac_lpow                                                        */
    __IOM uint32_t xaac_lut_manual_en : 1;    /*!< [24..24] xaac_lut_manual_en                                               */
  } b;                                        /*!< bit fields for syson_sys_xtal_aac_ctrl */
} syson_sys_xtal_aac_ctrl_t, *psyson_sys_xtal_aac_ctrl_t;

/**
  \brief Union type to access syson_sys_pll_ctrl0 (@ 0x00000070).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000070) System PLL Control Register0                               */
  
  struct {
    __IM  uint32_t            : 3;
    __IOM uint32_t pll_enc_div_sel : 3;       /*!< [5..3] output divider selection. Default=000 000=/1, 100=/4,
                                                   110=/8, 111=/16                                                           */
    __IOM uint32_t pll_enc_ps_en : 1;         /*!< [6..6] phase selector enable                                              */
    __IOM uint32_t pll_enc_div2_en : 1;       /*!< [7..7] output clk div 2 enable                                            */
    __IOM uint32_t pll_enc_clk_en : 1;        /*!< [8..8] output clk enable                                                  */
    __IOM uint32_t pll_enc_fref_edge_sel : 1; /*!< [9..9] 0:fref,1:frefb                                                     */
    __IM  uint32_t            : 12;
    __IOM uint32_t pll_enc_ps_sel : 3;        /*!< [24..22] pll_enc_ps_sel                                                   */
    __IOM uint32_t pll_enc_wdg_en : 1;        /*!< [25..25] 0: watch dog on ,1: watch dog off                                */
    __IM  uint32_t            : 3;
    __IOM uint32_t pll_enc_en : 1;            /*!< [29..29] (need pwl signal) 0->1                                           */
    __IOM uint32_t pll_enc_div_en : 1;        /*!< [30..30] input divider enable (need pwl signal) 0->1                      */
    __IOM uint32_t pll_enc_powcut_en : 1;     /*!< [31..31] erc enable.                                                      */
  } b;                                        /*!< bit fields for syson_sys_pll_ctrl0 */
} syson_sys_pll_ctrl0_t, *psyson_sys_pll_ctrl0_t;

/**
  \brief Union type to access syson_sys_pll_ctrl1 (@ 0x00000074).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000074) System PLL Control Register1                               */
  
