pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IM  uint32_t            : 5;
    __IOM uint32_t pll_enc_divn_sdm : 6;      /*!< [10..5] pll_enc_divn_sdm                                                  */
    __IOM uint32_t pll_enc_bb_dbg_sel_afe_sdm : 4;/*!< [14..11] pll_enc_bb_dbg_sel_afe_sdm                                   */
    __IOM uint32_t pll_enc_trig_rreq_en : 1;  /*!< [15..15] freq. step up or step down enable                                */
    __IOM uint32_t pll_enc_step_freq_sel : 4; /*!< [19..16] step size selection for switching freq.                          */
    __IOM uint32_t pll_enc_tbase_freq_sel : 4;/*!< [23..20] for output clk step up or step down                              */
    __IOM uint32_t pll_enc_freq_sel : 4;      /*!< [27..24] output clk selection, Default=200MHz                             */
  } b;                                        /*!< bit fields for syson_sys_pll_ctrl1 */
} syson_sys_pll_ctrl1_t, *psyson_sys_pll_ctrl1_t;

/**
  \brief Union type to access syson_sys_pll_ctrl2 (@ 0x00000078).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000078) System PLL Control Register2                               */
  
  struct {
    __IOM uint32_t pll_enc_ref_clk_sel : 1;   /*!< [0..0] 0-> select special route , 1-> digital APR                         */
    __IOM uint32_t pll_enc_sp_r_enb : 1;      /*!< [1..1] 0-> enable special route ,1-> disable special route                */
    __IM  uint32_t            : 4;
    __IOM uint32_t pll_enc_ssc_en : 1;        /*!< [6..6] ssc enable. Default=0                                              */
    __IOM uint32_t pll_enc_ssc_freq_sel : 12; /*!< [18..7] ssc freq selection                                                */
    __IOM uint32_t pll_enc_ssc_step_sel : 13; /*!< [31..19] ssc step size selection.                                         */
  } b;                                        /*!< bit fields for syson_sys_pll_ctrl2 */
} syson_sys_pll_ctrl2_t, *psyson_sys_pll_ctrl2_t;

/**
  \brief Union type to access syson_sys_pll_ctrl3 (@ 0x0000007C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000007C) System PLL Control Register3                               */
  
  struct {
    __IM  uint32_t            : 15;
    __IOM uint32_t pll_enc_sdm_order_sel : 1; /*!< [15..15] SDM order: 0:2nd order, 1:3rd order                              */
    __IOM uint32_t pll_enc_sdm_fon : 3;       /*!< [18..16] N code, feedback divider number 1 for 1/8                        */
    __IOM uint32_t pll_enc_sdm_fof : 13;      /*!< [31..19] F code, feedback divider number 1for 1/8*1/2^13                  */
  } b;                                        /*!< bit fields for syson_sys_pll_ctrl3 */
} syson_sys_pll_ctrl3_t, *psyson_sys_pll_ctrl3_t;

/**
  \brief Union type to access syson_osc128k_ctrl (@ 0x00000080).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000080) Osc128K Control Register                                   */
  
  struct {
    __IOM uint32_t sys_128k_en : 1;           /*!< [0..0] POW_128KOSC                                                        */
    __IOM uint32_t sys_128k_ldo_vref_sel : 1; /*!< [1..1] SEL_LDO_VREF                                                       */
    __IM  uint32_t            : 6;
    __IOM uint32_t sys_128k_rcal : 6;         /*!< [13..8] F=128k+(RCAL[5:0]-32)*128k*3_                                     */
  } b;                                        /*!< bit fields for syson_osc128k_ctrl */
} syson_osc128k_ctrl_t, *psyson_osc128k_ctrl_t;

/**
  \brief Union type to access syson_sys_32k_sdm_idr_ctrl0 (@ 0x00000088).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000088) 32K SDM Indirrect Access Control Register0                 */
  
  struct {
    __IOM uint32_t sdm_addr   : 6;            /*!< [5..0] SDM register offset                                                */
    __IM  uint32_t            : 2;
    __IOM uint32_t sdm_en     : 1;            /*!< [8..8] SDM function enable                                                */
    __IOM uint32_t sdm_clk_en : 1;            /*!< [9..9] SDM Pclk enable                                                    */
  } b;                                        /*!< bit fields for syson_sys_32k_sdm_idr_ctrl0 */
} syson_sys_32k_sdm_idr_ctrl0_t, *psyson_sys_32k_sdm_idr_ctrl0_t;

/**
  \brief Union type to access syson_sys_32k_sdm_idr_ctrl1 (@ 0x0000008C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000008C) 32K SDM Indirrect Access Control Register1                 */
  
  struct {
    __IOM uint32_t ls_sdm_data : 32;          /*!< [31..0] SDM register data, support byte write                             */
  } b;                                        /*!< bit fields for syson_sys_32k_sdm_idr_ctrl1 */
} syson_sys_32k_sdm_idr_ctrl1_t, *psyson_sys_32k_sdm_idr_ctrl1_t;

/**
  \brief Union type to access syson_xtal_aac_dbg (@ 0x000000A0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000A0) XTAL AAC Debugging Register                                */
  
  struct {
    __IM  uint32_t xtal_aac_rdy : 1;          /*!< [0..0] xtal_aac_rdy                                                       */
    __IM  uint32_t xtal_aac_dbg : 3;          /*!< [3..1] xtal_aac_dbg                                                       */
    __IM  uint32_t xtal_aac_state : 4;        /*!< [7..4] xtal_aac_state                                                     */
    __IM  uint32_t xtal_aac_done : 16;        /*!< [23..8] xtal_aac_done                                                     */
    __IM  uint32_t xtal_gm_out : 5;           /*!< [28..24] xtal_gm_out                                                      */
    __IM  uint32_t            : 2;
    __IM  uint32_t xtal_pkdet_out : 1;        /*!< [31..31] xtal_pkdet_out                                                   */
  } b;                                        /*!< bit fields for syson_xtal_aac_dbg */
} syson_xtal_aac_dbg_t, *psyson_xtal_aac_dbg_t;

/**
  \brief Union type to access syson_sys_debug_reg (@ 0x000000A4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000A4) System Debugging Register                                  */
  
