pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IM  uint32_t sys_dbg_value : 32;        /*!< [31..0] SYS debug register value. 0x30[7:0] select the debug
                                                   port                                                                      */
  } b;                                        /*!< bit fields for syson_sys_debug_reg */
} syson_sys_debug_reg_t, *psyson_sys_debug_reg_t;

/**
  \brief Union type to access syson_pad_ctrl (@ 0x000000AC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000AC) IO Pad Control Register                                    */
  
  struct {
    __IOM uint32_t gpiog_a_s_shdn : 1;        /*!< [0..0] GPIOA 3, 4, 6-12. PAD enable, 1: enable PAD, 0: shutdown           */
    __IOM uint32_t gpiog_a_f_shdn : 1;        /*!< [1..1] GPIOA 13, 16, 17, 18, 21, 22., PAD enable 1: enable PAD,
                                                   0: shutdown                                                               */
    __IM  uint32_t            : 2;
    __IOM uint32_t gpioga_rstb33 : 1;         /*!< [4..4] 0: reset GPIO group A pull control                                 */
    __IOM uint32_t gpioga_h3l1_ctrl0 : 1;     /*!< [5..5] IO pad power voltage of GPIO A0-12 0:1.8V; 1:3.3V                  */
    __IOM uint32_t gpioga_h3l1_ctrl1 : 1;     /*!< [6..6] IO pad power voltage of GPIO A15-23 0:1.8V; 1:3.3V                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpiog_b_shdn : 1;          /*!< [8..8] PAD enable, 1: enable PAD, 0: shutdown                             */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpiogb_rstb33 : 1;         /*!< [12..12] 0: reset GPIO group B pull control                               */
    __IOM uint32_t gpiogb_h3l1 : 1;           /*!< [13..13] GPIO_B 3.3V IO pad input voltage level of High: 0:1.8V;
                                                   1:3.3V                                                                    */
    __IM  uint32_t            : 2;
    __IOM uint32_t vd5v_sel   : 1;            /*!< [16..16] select the Power source from REGU,1: 5V_LDO_IN, 0:
                                                   5V_LDO_OUT                                                                */
    __IOM uint32_t io5v_h5l3  : 1;            /*!< [17..17] 5V IO pad input voltage level of High: 0: 3.3V; 1:
                                                   5V                                                                        */
    __IM  uint32_t            : 6;
    __IOM uint32_t trap_shdn  : 1;            /*!< [24..24] A0,1,2,5,23 PAD enable, 1: enable PAD, 0: shutdown               */
  } b;                                        /*!< bit fields for syson_pad_ctrl */
} syson_pad_ctrl_t, *psyson_pad_ctrl_t;

/**
  \brief Union type to access syson_gpioa0_1_ctrl (@ 0x000000B0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000B0) GPIOA0 and GPIOA1 Control Register                         */
  
  struct {
    __IOM uint32_t gpioa0_pinmux_sel : 3;     /*!< [2..0] 000: Reserved 001: JTAG_CLK 010: UART1_IN 011: EXT_32K
                                                   100: SIC_SCL 101: PMM0 110: WL_UART_IN 111: GPIO                          */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa0_pull_ctrl_1_0 : 2;  /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa0_smt_en : 1;         /*!< [9..9] Enable GPIOA0 Schmitt trigger; 1: enable                           */
    __IOM uint32_t gpioa0_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t gpioa1_pinmux_sel : 3;     /*!< [18..16] 000: Reserved 001: JTAG_TMS 010: UART1_OUT 011: BT_led
                                                   100: SIC_DA 101: PWM1 110: WL_UART_OUT 111: GPIO                          */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa1_pull_ctrl_1_0 : 2;  /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                   high; 2b'11: reserved                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa1_smt_en : 1;         /*!< [25..25] Enable GPIOA1 Schmitt trigger; 1: enable                         */
    __IOM uint32_t gpioa1_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpioa0_1_ctrl */
} syson_gpioa0_1_ctrl_t, *psyson_gpioa0_1_ctrl_t;

/**
  \brief Union type to access syson_gpioa2_3_ctrl (@ 0x000000B4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000B4) GPIOA2 and GPIOA3 Control Register                         */
  
  struct {
    __IOM uint32_t gpioa2_pinmux_sel : 3;     /*!< [2..0] 000: 001: JTAG_TDO 010: UART1_IN 011: SPI_CS 100: I2C0_SCL
                                                   101: PWM2 110: 111: GPIO                                                  */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa2_pull_ctrl_1_0 : 2;  /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa2_smt_en : 1;         /*!< [9..9] Enable GPIOA2 Schmitt trigger; 1: enable                           */
    __IOM uint32_t gpioa2_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t gpioa3_pinmux_sel : 3;     /*!< [18..16] 000: Reserved 001: JTAG_TDI 010: UART1_OUT 011: SPI_SCL
                                                   100: I2C0_SDA 101: PWM3 110: reserved 111: GPIO                           */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa3_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                   high; 2b'11: reserved                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa3_smt_en : 1;         /*!< [25..25] Enable GPIOA3 Schmitt trigger; 1: enable                         */
    __IOM uint32_t gpioa3_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpioa2_3_ctrl */
} syson_gpioa2_3_ctrl_t, *psyson_gpioa2_3_ctrl_t;

/**
  \brief Union type to access syson_gpioa4_5_ctrl (@ 0x000000B8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000B8) GPIO A4 and GPIO A5 Control Register                       */
  
