pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t gpioa4_pinmux_sel : 3;     /*!< [2..0] 000: Reserved 001: JTAG_TRST 010: UART1_CTS 011: SPI_MOSI
                                                   100: Reserved 101: PWM4 110: Reserved 111: GPIO                           */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa4_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa4_smt_en : 1;         /*!< [9..9] Enable GPIOA4 Schmitt trigger; 1: enable                           */
    __IOM uint32_t gpioa4_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t gpioa5_pinmux_sel : 3;     /*!< [18..16] 000: 001: 010: UART1_RTS 011: SPI_MISO 100: 101: PWM5
                                                   110: 111: GPIO                                                            */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa5_pull_ctrl_1_0 : 2;  /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                   high; 2b'11: reserved                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa5_smt_en : 1;         /*!< [25..25] Enable GPIOA5 Schmitt trigger; 1: enable                         */
    __IOM uint32_t gpioa5_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpioa4_5_ctrl */
} syson_gpioa4_5_ctrl_t, *psyson_gpioa4_5_ctrl_t;

/**
  \brief Union type to access syson_gpioa6_7_ctrl (@ 0x000000BC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000BC) GPIO A6 and GPIO A7 Control Register                       */
  
  struct {
    __IOM uint32_t gpioa6_pinmux_sel : 3;     /*!< [2..0] 000: reserved 001: reserved 010: reserved 011: reserved
                                                   100: reserved 101: PWM6 110: reserved 111: GPIO                           */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa6_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa6_smt_en : 1;         /*!< [9..9] Enable GPIOA6 Schmitt trigger; 1: enable                           */
    __IOM uint32_t gpioa6_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t gpioa7_pinmux_sel : 3;     /*!< [18..16] 000: SPI_M_CS 001: Reserved 010: Reserved 011: SPI_CS
                                                   100: Reserved 101: Reserved 110: Reserved 111: GPIO                       */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa7_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                   high; 2b'11: reserved                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa7_smt_en : 1;         /*!< [25..25] Enable GPIOA7 Schmitt trigger; 1: enable                         */
    __IOM uint32_t gpioa7_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpioa6_7_ctrl */
} syson_gpioa6_7_ctrl_t, *psyson_gpioa6_7_ctrl_t;

/**
  \brief Union type to access syson_gpioa8_9_ctrl (@ 0x000000C0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000C0) GPIO A8 and GPIO A9 Control Register                       */
  
  struct {
    __IOM uint32_t gpioa8_pinmux_sel : 3;     /*!< [2..0] 000: SPI_M_CLK 001: Reserved 010: Reserved 011: SPI_CLK
                                                   100: Reserved 101: Reserved 110: Reserved 111: GPIO                       */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa8_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa8_smt_en : 1;         /*!< [9..9] Enable GPIOA8 Schmitt trigger; 1: enable                           */
    __IOM uint32_t gpioa8_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t gpioa9_pinmux_sel : 3;     /*!< [18..16] 000: SPI_M_D2 001: Reserved 010: UART0_RTS 011: SPI_MOSI
                                                   100: Reserved 101: Reserved 110: Reserved 111: GPIO                       */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa9_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                   high; 2b'11: reserved                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa9_smt_en : 1;         /*!< [25..25] Enable GPIOA9 Schmitt trigger; 1: enable                         */
    __IOM uint32_t gpioa9_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpioa8_9_ctrl */
} syson_gpioa8_9_ctrl_t, *psyson_gpioa8_9_ctrl_t;

/**
  \brief Union type to access syson_gpioa10_11_ctrl (@ 0x000000C4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000C4) GPIO A10 and GPIO A11 Control Register                     */
  
