pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t gpioa22_pinmux_sel : 3;    /*!< [2..0] 000: Reserved 001: Reserved 010: UART2_OUT 011: LED0
                                                   100: I2C0_SDA 101: PWM2 110: RFE_CTRL1 111: GPIO                          */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa22_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa22_smt_en : 1;        /*!< [9..9] Enable GPIOA22 Schmitt trigger; 1: enable                          */
    __IOM uint32_t gpioa22_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t gpioa23_pinmux_sel : 3;    /*!< [18..16] 000: Reserved 001: Reserved 010: Reserved 011: LED0
                                                   100: Reserved 101: PWM7 110: RFE_CTRL2 111: GPIO                          */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpioa23_pull_ctrl_1_0 : 2; /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                   high; 2b'11: reserved                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpioa23_smt_en : 1;        /*!< [25..25] Enable GPIOA23 Schmitt trigger; 1: enable                        */
    __IOM uint32_t gpioa23_driving : 2;       /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpioa22_23_ctrl */
} syson_gpioa22_23_ctrl_t, *psyson_gpioa22_23_ctrl_t;

/**
  \brief Union type to access syson_sys_eeprom_ctrl0 (@ 0x000000E0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000E0) System EEPROM Control Register                             */
  
  struct {
    __IM  uint32_t            : 5;
    __IOM uint32_t sys_autoload_sus : 1;      /*!< [5..5] 1: Autoload successful 0: Autoload fail                            */
    __IM  uint32_t            : 10;
    __IOM uint32_t sys_efuse_ldall : 1;       /*!< [16..16] 1: SW enable HWSM to autoload excluding Efuse 0x00~
                                                   0x31                                                                      */
    __IM  uint32_t            : 7;
    __IOM uint32_t efuse_pgpwd : 8;           /*!< [31..24] Efuse Program password, write 0x69 for programing                */
  } b;                                        /*!< bit fields for syson_sys_eeprom_ctrl0 */
} syson_sys_eeprom_ctrl0_t, *psyson_sys_eeprom_ctrl0_t;

/**
  \brief Union type to access syson_sys_efuse_ctrl (@ 0x000000E8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000E8) System eFuse Control Register                              */
  
  struct {
    __IOM uint32_t sys_ef_data : 8;           /*!< [7..0] Access Data                                                        */
    __IOM uint32_t sys_ef_addr : 10;          /*!< [17..8] Access Address                                                    */
    __IOM uint32_t sys_ef_alden : 1;          /*!< [18..18] Autoload Enable                                                  */
    __IOM uint32_t sys_ef_pdwn : 1;           /*!< [19..19] Efuse power down                                                 */
    __IOM uint32_t sys_ef_tpg2avdd : 2;       /*!< [21..20] Tsp_pg_avdd 00:1000ns, 01:1250ns, 10:1500ns 11:1750ns.
                                                   (CLK freq: 4M)                                                            */
    __IM  uint32_t            : 2;
    __IOM uint32_t sys_ef_tstrobe : 3;        /*!< [26..24] Tstrobe (AEN width) 000: 7000ns, 001:8000ns, 010: 9000ns,
                                                   011: 10000ns,100:11000ns, 101:12000ns, 110: 13000ns, 111:14000ns.
                                                   (CLK freq: 4Mhz)                                                          */
    __IM  uint32_t            : 1;
    __IOM uint32_t sys_ef_tgap : 2;           /*!< [29..28] 00: 2000ns, 01:2250ns, 10:2500ns, 11:2750ns. (CLK freq:
                                                   4Mhz)                                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t sys_ef_rwflag : 1;         /*!< [31..31] Write 1 for Program; Write 0 for Read Access                     */
  } b;                                        /*!< bit fields for syson_sys_efuse_ctrl */
} syson_sys_efuse_ctrl_t, *psyson_sys_efuse_ctrl_t;

/**
  \brief Union type to access syson_sys_efuse_test (@ 0x000000EC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000EC) eFuse Test Register                                        */
  
  struct {
    __IOM uint32_t sys_ef_scan_tthd : 7;      /*!< [6..0] Bit number for all cells scan test                                 */
    __IOM uint32_t sys_ef_trpt : 1;           /*!< [7..7] Test Scan Report: 1 : Fail, 0 : OK                                 */
    __IM  uint32_t            : 3;
    __IOM uint32_t sys_ef_force_pgmen : 1;    /*!< [11..11] SW force PGMEN input of efuse to high. (for the bank
                                                   selected by 0x34[9:8])                                                    */
    __IOM uint32_t sys_ef_scan_end : 4;       /*!< [15..12] Residual bytes Setting for SCAN (0~15)                           */
    __IOM uint32_t sys_ef_scan_start : 9;     /*!< [24..16] SCAN start Address (unit in byte)                                */
    __IM  uint32_t            : 1;
    __IOM uint32_t sys_ef_cres_sel : 1;       /*!< [26..26] Efuse CRES selection, 0: 10k ; 1: 1.5k                           */
  } b;                                        /*!< bit fields for syson_sys_efuse_test */
} syson_sys_efuse_test_t, *psyson_sys_efuse_test_t;

/**
  \brief Union type to access syson_sys_sw_reserv0 (@ 0x000000F0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F0) SW reserved Register0                                      */
  
