pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t sw_resv0   : 32;           /*!< [31..0] SW reserved register0                                             */
  } b;                                        /*!< bit fields for syson_sys_sw_reserv0 */
} syson_sys_sw_reserv0_t, *psyson_sys_sw_reserv0_t;

/**
  \brief Union type to access syson_sys_sw_reserv1 (@ 0x000000F4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F4) SW reserved Register1                                      */
  
  struct {
    __IOM uint32_t sw_resv1   : 32;           /*!< [31..0] SW reserved register1                                             */
  } b;                                        /*!< bit fields for syson_sys_sw_reserv1 */
} syson_sys_sw_reserv1_t, *psyson_sys_sw_reserv1_t;

/**
  \brief Union type to access syson_sys_sw_reserv2 (@ 0x000000F8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000F8) SW reserved Register2                                      */
  
  struct {
    __IOM uint32_t sw_resv2   : 32;           /*!< [31..0] SW reserved register2                                             */
  } b;                                        /*!< bit fields for syson_sys_sw_reserv2 */
} syson_sys_sw_reserv2_t, *psyson_sys_sw_reserv2_t;

/**
  \brief Union type to access syson_sys_sw_reserv3 (@ 0x000000FC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000FC) SW reserved Register3                                      */
  
  struct {
    __IOM uint32_t sw_resv3   : 32;           /*!< [31..0] SW reserved register3                                             */
  } b;                                        /*!< bit fields for syson_sys_sw_reserv3 */
} syson_sys_sw_reserv3_t, *psyson_sys_sw_reserv3_t;

/**
  \brief Union type to access syson_sys_slp_wake_event_msk0 (@ 0x00000100).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000100) System Wake Up Event Mask Register                         */
  
  struct {
    __IOM uint32_t syson_wevt_lpgtim_msk : 1; /*!< [0..0] 1: enable LP Timer Wakeup SYSON event; 0: disable the
                                                   event to wakeup system                                                    */
    __IOM uint32_t syson_wevt_hsgtim_msk : 1; /*!< [1..1] 1: enable HSGtimer Wakeup SYSON event; 0: disable the
                                                   event to wakeup system                                                    */
    __IOM uint32_t syson_wevt_over_current_msk : 1;/*!< [2..2] 1: enable OCP wakeup event; 0: disable the event to wakeup
                                                   system                                                                    */
    __IM  uint32_t            : 1;
    __IOM uint32_t syson_wevt_gpio_int_msk : 1;/*!< [4..4] 1: enable GPIO interrupt Wakeup event; 0: disable the
                                                   event to wakeup system                                                    */
    __IOM uint32_t syson_wevt_pwm_msk : 1;    /*!< [5..5] 1: enable PWM Wakeup event; 0: disable the event to wakeup
                                                   system                                                                    */
    __IOM uint32_t syson_wevt_i2c0_addr_macth_msk : 1;/*!< [6..6] 1:enable wakeup event of I2C0 RX address match             */
    __IM  uint32_t            : 1;
    __IOM uint32_t syson_wevt_wlan_msk : 1;   /*!< [8..8] 1: enable WLAN Wakeup event; 0: disable the event to
                                                   wakeup system                                                             */
    __IOM uint32_t syson_wevt_i2c0_msk : 1;   /*!< [9..9] 1: enable I2C0 Wakeup event; 0: disable the event to
                                                   wakeup system                                                             */
    __IM  uint32_t            : 1;
    __IOM uint32_t syson_wevt_uart_msk : 1;   /*!< [11..11] 1: enable UART Wakeup event; 0: disable the event to
                                                   wakeup system All UART0 ~ UART3 (including BT UART) wake
                                                   events are combined to 1 event for PMU.                                   */
    __IM  uint32_t            : 2;
    __IOM uint32_t syson_wevt_sdio_msk : 1;   /*!< [14..14] 1: enable SDIO Wakeup event; 0: disable the event to
                                                   wakeup system                                                             */
    __IM  uint32_t            : 15;
    __IOM uint32_t syson_wevt_bor2_msk : 1;   /*!< [30..30] 1: enable brown out reset Wakeup event; 0: disable
                                                   the event to wakeup system                                                */
  } b;                                        /*!< bit fields for syson_sys_slp_wake_event_msk0 */
} syson_sys_slp_wake_event_msk0_t, *psyson_sys_slp_wake_event_msk0_t;

/**
  \brief Union type to access syson_sys_slp_wake_event_status0 (@ 0x00000108).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000108) System Wake Up Event Status Register                       */
  
  struct {
    __IOM uint32_t syson_wevt_lpgtim_sts : 1; /*!< [0..0] 1: Indicate SYSON LPTimer Wakeup SYSON event status;
                                                   Write 1 to clear.                                                         */
    __IM  uint32_t syson_wevt_hsgtim_sts : 1; /*!< [1..1] 1: Indicate HSGtimer Wakeup SYSON event;                           */
    __IOM uint32_t syson_wevt_over_current_sts : 1;/*!< [2..2] 1: Indicate OCP event status, write 1 to clear.               */
    __IM  uint32_t            : 1;
    __IM  uint32_t syson_wevt_gpio_int_sts : 1;/*!< [4..4] 1: Indicate GPIO interrupt Wakeup event;                          */
    __IM  uint32_t syson_wevt_pwm_sts : 1;    /*!< [5..5] 1: indicate PWM Wakeup event                                       */
    __IM  uint32_t syson_wevt_i2c0_addr_macth_sts : 1;/*!< [6..6] 1:inidcate wakeup event of I2C0 RX address match           */
    __IM  uint32_t            : 1;
    __IM  uint32_t syson_wevt_wlan_sts : 1;   /*!< [8..8] 1: enable WLAN Wakeup event; 0: disable the event to
                                                   wakeup system                                                             */
    __IM  uint32_t syson_wevt_i2c0_sts : 1;   /*!< [9..9] 1: indicate I2C0 Wakeup event                                      */
    __IM  uint32_t            : 1;
    __IM  uint32_t syson_wevt_uart_sts : 1;   /*!< [11..11] 1: indicate UART Wakeup event All UART0 ~ UART3 (including
                                                   BT UART) wake events are combined to 1 event for PMU.                     */
    __IM  uint32_t            : 2;
    __IM  uint32_t syson_wevt_sdio_sts : 1;   /*!< [14..14] 1: indicate SDIO Wakeup event                                    */
    __IM  uint32_t            : 15;
    __IOM uint32_t syson_wevt_bor2_sts : 1;   /*!< [30..30] Brown out reset status, write 1 to clear.                        */
  } b;                                        /*!< bit fields for syson_sys_slp_wake_event_status0 */
} syson_sys_slp_wake_event_status0_t, *psyson_sys_slp_wake_event_status0_t;

/**
  \brief Union type to access syson_sys_snf_wake_event_status (@ 0x00000114).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000114) System Sniff Mode Wake Up Event Status Register            */
  
