pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IM  uint32_t            : 1;
    __IOM uint32_t syson_snfevt_wlon_pon_sts : 1;/*!< [1..1] 1: indicate wlan power on wakeup status                         */
  } b;                                        /*!< bit fields for syson_sys_snf_wake_event_status */
} syson_sys_snf_wake_event_status_t, *psyson_sys_snf_wake_event_status_t;

/**
  \brief Union type to access syson_sys_pwrmgt_ctrl (@ 0x00000118).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000118) System Power Management Register                           */
  
  struct {
    __IOM uint32_t syson_pm_cmd_dslp : 1;     /*!< [0..0] 1: command SYSON SM to enter deep sleep state,when PMC
                                                   finishes the process, this bit will be auto clear to 0                    */
    __IOM uint32_t syson_pm_cmd_slp : 1;      /*!< [1..1] 1: command SYSON SM to enter sleep state, when PMC finishes
                                                   the process, this bit will be auto clear to 0                             */
  } b;                                        /*!< bit fields for syson_sys_pwrmgt_ctrl */
} syson_sys_pwrmgt_ctrl_t, *psyson_sys_pwrmgt_ctrl_t;

/**
  \brief Union type to access syson_sys_pwrmgt_option (@ 0x00000120).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000120) System Power Management Option Register                    */
  
  struct {
    __IM  uint32_t            : 9;
    __IOM uint32_t syson_pmopt_slp_en_swr : 1;/*!< [9..9] 1: power enable SWR/LDO 1.2V when enter into sleep mode;
                                                   0: disable SWR/LDO                                                        */
    __IOM uint32_t syson_pmopt_slp_en_pwm : 1;/*!< [10..10] 1: power enable SWR/LDO output heavy loading current
                                                   mode when enter into sleep mode; 0: disable SWR/LDO output
                                                   heavy loading mode                                                        */
    __IOM uint32_t syson_pmopt_slp_en_soc : 1;/*!< [11..11] 1: power enable SOC platform when enter into sleep
                                                   mode; 0: power off SoC domain                                             */
    __IOM uint32_t syson_pmopt_slp_xtal_en : 1;/*!< [12..12] 1: enable XTAL when enter into sleep mode; 0: disable
                                                   XTAL                                                                      */
    __IOM uint32_t syson_pmopt_slp_syspll_en : 1;/*!< [13..13] 1: enable syspem PLL when enter into sleep mode; 0:
                                                   disable SYSPLL                                                            */
    __IOM uint32_t syson_pmopt_slp_mem_pm_en : 1;/*!< [14..14] 0: Enable memory DS mode when enter into power mode
                                                   ; 1: memory normal mode when enter into power mode                        */
    __IOM uint32_t syson_pmopt_slp_5vldo_mediumld_en : 1;/*!< [15..15] 0: enable 5VLDO medium load when enter into sleep mode,
                                                   0x44[11:10] = 2b'01; 1: do not change                                     */
    __IOM uint32_t syson_pmopt_slp_5vldo_lightld_en : 1;/*!< [16..16] 0: enable 5VLDO light load when enter into sleep mode,
                                                   0x44[11:10] = 2b'11; 1: do not change                                     */
    __IOM uint32_t syson_pmopt_snz_en_swr : 1;/*!< [17..17] 1: power enable SWR/LDO 1.2V when enter into snooze
                                                   mode; 0: disable SWR/LDO                                                  */
    __IOM uint32_t syson_pmopt_snz_en_pwm : 1;/*!< [18..18] 1: power enable SWR/LDO output heavy loading current
                                                   mode when enter into snooze mode; 0: disable SWR/LDO output
                                                   heavy loading mode                                                        */
    __IM  uint32_t            : 1;
    __IOM uint32_t syson_pmopt_snz_xtal_en : 1;/*!< [20..20] 1: enable XTAL when enter into snooze mode; 0: disable
                                                   XTAL                                                                      */
    __IM  uint32_t            : 2;
    __IOM uint32_t syson_pmopt_snz_5vldo_normal_en : 1;/*!< [23..23] 0: enable 5VLDO medium load when enter into snooze
                                                   mode, 0x44[11:10] = 2b'00; 1: do not change                               */
    __IOM uint32_t syson_pmopt_snz_5vldo_mediumld_en : 1;/*!< [24..24] 0: enable 5VLDO medium load when enter into snooze
                                                   mode, 0x44[11:10] = 2b'01 ; 1: do not change                              */
  } b;                                        /*!< bit fields for syson_sys_pwrmgt_option */
} syson_sys_pwrmgt_option_t, *psyson_sys_pwrmgt_option_t;

/**
  \brief Union type to access syson_sys_pwrmgt_option_ext (@ 0x00000124).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000124) System Power Management Extension Option Register          */
  
  struct {
    __IM  uint32_t            : 1;
    __IOM uint32_t syson_pmopt_slp_anack_en : 1;/*!< [1..1] 1: enable syson register clock when enter into sleep
                                                   mode; 0: disable syson register clock                                     */
    __IOM uint32_t syson_pmopt_slp_anack_sel : 1;/*!< [2..2] 1: set ANA clock to 4MHz when enter into power mode;
                                                   0: set ANA clock to 250KHz when enter into power mode;                    */
  } b;                                        /*!< bit fields for syson_sys_pwrmgt_option_ext */
} syson_sys_pwrmgt_option_ext_t, *psyson_sys_pwrmgt_option_ext_t;

/**
  \brief Union type to access syson_non_reset_ff (@ 0x00000138).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000138) non-Reset Flags                                            */
  
