pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t gpiob6_pinmux_sel : 3;     /*!< [2..0] 000: SPI_M_D2 001: Reserved 010: Reserved 011: Reserved
                                                   100: Reserved 101: Reserved 110: Reserved 111: LPC_CK                     */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpiob6_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpiob6_smt_en : 1;         /*!< [9..9] Enable GPIOB6 Schmitt trigger; 1: enable                           */
    __IOM uint32_t gpiob6_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t gpiob7_pinmux_sel : 3;     /*!< [18..16] 000: SPI_M_D1 001: Reserved 010: Reserved 011: Reserved
                                                   100: Reserved 101: Reserved 110: Reserved 111: LPC_CK                     */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpiob7_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                   high; 2b'11: reserved                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpiob7_smt_en : 1;         /*!< [25..25] Enable GPIOB7 Schmitt trigger; 1: enable                         */
    __IOM uint32_t gpiob7_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpiob6_7_ctrl */
} syson_gpiob6_7_ctrl_t, *psyson_gpiob6_7_ctrl_t;

/**
  \brief Union type to access syson_gpiob8_9_ctrl (@ 0x00000160).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000160) GPIO B8 and GPIO B9 Control Register                       */
  
  struct {
    __IOM uint32_t gpiob8_pinmux_sel : 3;     /*!< [2..0] 000: SPI_M_CS 001: Reserved 010: Reserved 011: Reserved
                                                   100: Reserved 101: Reserved 110: Reserved 111: LPC_D4                     */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpiob8_pull_ctrl : 2;      /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpiob8_smt_en : 1;         /*!< [9..9] Enable GPIOB8 Schmitt trigger; 1: enable                           */
    __IOM uint32_t gpiob8_driving : 2;        /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t gpiob9_pinmux_sel : 3;     /*!< [18..16] 000: Reserved 001: Reserved 010: Reserved 011: Reserved
                                                   100: Reserved 101: Reserved 110: Reserved 111: LPC_D5                     */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpiob9_pull_ctrl : 2;      /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                   high; 2b'11: reserved                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpiob9_smt_en : 1;         /*!< [25..25] Enable GPIOB9 Schmitt trigger; 1: enable                         */
    __IOM uint32_t gpiob9_driving : 2;        /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpiob8_9_ctrl */
} syson_gpiob8_9_ctrl_t, *psyson_gpiob8_9_ctrl_t;

/**
  \brief Union type to access syson_gpiob10_11_ctrl (@ 0x00000164).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000164) GPIO B10 and GPIO B11 Control Register                     */
  
  struct {
    __IOM uint32_t gpiob10_pinmux_sel : 3;    /*!< [2..0] 000: SPI_M_D3 001: Reserved 010: Reserved 011: Reserved
                                                   100: Reserved 101: Reserved 110: Reserved 111: LPC_D6                     */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpiob10_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpiob10_smt_en : 1;        /*!< [9..9] Enable GPIOB10 Schmitt trigger; 1: enable                          */
    __IOM uint32_t gpiob10_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
    __IM  uint32_t            : 4;
    __IOM uint32_t gpiob11_pinmux_sel : 3;    /*!< [18..16] 000: SPI_M_CLK 001: Reserved 010: Reserved 011: Reserved
                                                   100: Reserved 101: Reserved 110: Reserved 111: LPC_D7                     */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpiob11_pull_ctrl : 2;     /*!< [23..22] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull
                                                   high; 2b'11: reserved                                                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpiob11_smt_en : 1;        /*!< [25..25] Enable GPIOB11 Schmitt trigger; 1: enable                        */
    __IOM uint32_t gpiob11_driving : 2;       /*!< [27..26] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpiob10_11_ctrl */
} syson_gpiob10_11_ctrl_t, *psyson_gpiob10_11_ctrl_t;

/**
  \brief Union type to access syson_gpiob12_ctrl (@ 0x00000168).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000168) GPIO B10 and GPIO B11 Control Register                     */
  
