pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t gpiob12_pinmux_sel : 3;    /*!< [2..0] 000: SPI_M_D0 001: Reserved 010: Reserved 011: Reserved
                                                   100: Reserved 101: Reserved 110: Reserved 111: LPC_RWDS                   */
    __IM  uint32_t            : 3;
    __IOM uint32_t gpiob12_pull_ctrl : 2;     /*!< [7..6] 2b'00: high impedence; 2b'01: pull low; 2b'10: pull high;
                                                   2b'11: reserved                                                           */
    __IM  uint32_t            : 1;
    __IOM uint32_t gpiob12_smt_en : 1;        /*!< [9..9] Enable GPIOB12 Schmitt trigger; 1: enable                          */
    __IOM uint32_t gpiob12_driving : 2;       /*!< [11..10] (E3,E2)=(10:9) 1.8V: 00: 2mA; 01: 4mA; 10: 6mA; 11:
                                                   8mA 3.3V: 00: 4mA; 01: 6mA; 10: 12mA; 11: 16mA                            */
  } b;                                        /*!< bit fields for syson_gpiob12_ctrl */
} syson_gpiob12_ctrl_t, *psyson_gpiob12_ctrl_t;

/**
  \brief Union type to access syson_test_ctrl (@ 0x000001E8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000001E8) Test Control Register                                      */
  
  struct {
    __IOM uint32_t pll_bypass_en : 1;         /*!< [0..0] 1: enable PLL_BYPASS in test mode                                  */
    __IOM uint32_t scan_compression_en : 1;   /*!< [1..1] 1: enable scan compression                                         */
  } b;                                        /*!< bit fields for syson_test_ctrl */
} syson_test_ctrl_t, *psyson_test_ctrl_t;

/**
  \brief Union type to access syson_test_mux_ctrl (@ 0x000001EC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000001EC) Test Mux Control Register                                  */
  
  struct {
    __IOM uint32_t scan_mod0_en : 1;          /*!< [0..0] 1: enable CP scan test mux                                         */
    __IOM uint32_t scan_mod1_en : 1;          /*!< [1..1] 1: enable FT1 scan test mux                                        */
    __IOM uint32_t scan_mod2_en : 1;          /*!< [2..2] 1: enable FT2 scan test mux                                        */
    __IM  uint32_t            : 5;
    __IOM uint32_t mbist_en   : 1;            /*!< [8..8] 1: enable MBIST test mux                                           */
    __IM  uint32_t            : 7;
    __IOM uint32_t regu_test_mux_en : 1;      /*!< [16..16] 1: enable REGU test mux                                          */
    __IOM uint32_t rfafe_test_mux_en : 1;     /*!< [17..17] 1: enable RFAFE test mux                                         */
    __IOM uint32_t pll_test_mux_en : 1;       /*!< [18..18] 1: enable PLL test mux                                           */
  } b;                                        /*!< bit fields for syson_test_mux_ctrl */
} syson_test_mux_ctrl_t, *psyson_test_mux_ctrl_t;

/**
  \brief Union type to access syson_sys_system_cfg0 (@ 0x000001F0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000001F0) System Configuration Register0                             */
  
  struct {
    __IM  uint32_t rf_rl_id   : 4;            /*!< [3..0] Vendor ID defined in RF                                            */
    __IM  uint32_t chip_ver   : 4;            /*!< [7..4] Chip version: 0000 : A-cut 0001 : B-cut 0010 : C-cut
                                                   0011 : D-cut ...e.t.c.                                                    */
    __IM  uint32_t vendor_id  : 4;            /*!< [11..8] BIT_VENDOR_ID[3:2] : Process 00: TSMC , 01: SMIC, 10:
                                                   UMC BIT_VENDOR_ID[1] : rsve BIT_VENDOR_ID[0] : 0 : BT do
                                                   not exist in IC 1 : BT exist in IC                                        */
    __IM  uint32_t            : 4;
    __IM  uint32_t chip_type  : 1;            /*!< [16..16] 1: Test chip; 0:MP                                               */
    __IM  uint32_t            : 7;
    __IM  uint32_t bd_opt0    : 1;            /*!< [24..24] BD_OPT0                                                          */
    __IM  uint32_t disable_cck : 1;           /*!< [25..25] BD_OPT1 = Disable_CCK                                            */
    __IM  uint32_t ext_clk    : 1;            /*!< [26..26] BD_OPT2 = EXT_CLK                                                */
    __IM  uint32_t ext_rstb   : 1;            /*!< [27..27] BD_OPT3 = EXT_RSTB                                               */
    __IM  uint32_t            : 2;
    __IM  uint32_t chip_en    : 1;            /*!< [30..30] CHIP_EN PIN input value                                          */
    __IM  uint32_t syscfg_bd_pkg_sel : 1;     /*!< [31..31] Trapped PKG_ENG_SEL value 0: normal package; 1: engineering
                                                   mode                                                                      */
  } b;                                        /*!< bit fields for syson_sys_system_cfg0 */
} syson_sys_system_cfg0_t, *psyson_sys_system_cfg0_t;

/**
  \brief Union type to access syson_sys_system_cfg1 (@ 0x000001F4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000001F4) System Configuration Register1                             */
  
  struct {
    __IOM uint32_t syscfg_aldn_sts : 1;       /*!< [0..0] 1: SYS CFG autoload done; 0; SYSCFG autoload not ready             */
    __IM  uint32_t            : 7;
    __IM  uint32_t sys_xclk_vld : 1;          /*!< [8..8] Xtal Clock Stable, 1: Clock Stable                                 */
    __IM  uint32_t sys_syspll_clk_rdy : 1;    /*!< [9..9] SYS PLL Clock Stable, 1: Clock Stable                              */
    __IM  uint32_t sys_128k_rdy : 1;          /*!< [10..10] 1: 128K RDY                                                      */
    __IM  uint32_t            : 5;
    __IM  uint32_t v11_vld    : 1;            /*!< [16..16] 1.1V Power Ready, 1: Power Ready                                 */
    __IM  uint32_t            : 7;
    __IM  uint32_t syscfg_trp_efuse_autoload_dis : 1;/*!< [24..24] 1: disable efuse autoload 0: enable efuse autoload        */
    __IM  uint32_t syscfg_trp_spsldo_sel : 1; /*!< [25..25] Trapped Selection for SPS 0: SWR mode; 1: LDO mode               */
    __IM  uint32_t syscfg_trp_test_mode_sel : 1;/*!< [26..26] Trapped Selection for Test mode 0: normal mode; 1:
                                                   test mode                                                                 */
  } b;                                        /*!< bit fields for syson_sys_system_cfg1 */
} syson_sys_system_cfg1_t, *psyson_sys_system_cfg1_t;

/**
  \brief Union type to access syson_sys_system_cfg2 (@ 0x000001F8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000001F8) System Configuration Register2                             */
  
