pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t syscfg_rom_info : 8;       /*!< [7..0] ROM Information                                                    */
  } b;                                        /*!< bit fields for syson_sys_system_cfg2 */
} syson_sys_system_cfg2_t, *psyson_sys_system_cfg2_t;

/**
  \brief Union type to access syson_platform_cfg (@ 0x0000020C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000020C) Platform Configuration Register                            */
  
  struct {
    __IOM uint32_t sys_big_endian : 1;        /*!< [0..0] sys_big_endian                                                     */
    __IOM uint32_t auto_icg_en : 1;           /*!< [1..1] auto_icg_en                                                        */
    __IOM uint32_t dmac_clk_always_en : 1;    /*!< [2..2] dmac_clk_always_en                                                 */
    __IOM uint32_t dmac_clk_always_dis : 1;   /*!< [3..3] dmac_clk_always_dis                                                */
  } b;                                        /*!< bit fields for syson_platform_cfg */
} syson_platform_cfg_t, *psyson_platform_cfg_t;

/**
  \brief Union type to access syson_soc_func_en (@ 0x00000210).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000210) SOC Function Enable Control Register                       */
  
  struct {
    __IOM uint32_t soccore_en : 1;            /*!< [0..0] 1: enable SOC block. SoC include: vendor, uart_1&2, i2c,
                                                   SPI, CPU, X-bus, and SDIO off.                                            */
    __IOM uint32_t soc_bus_en : 1;            /*!< [1..1] 1: enable X-bus bus                                                */
    __IOM uint32_t soc_vendor_en : 1;         /*!< [2..2] 1: enable vendor                                                   */
    __IM  uint32_t            : 1;
    __IOM uint32_t soc_flash_en : 1;          /*!< [4..4] 1: enable flash controller                                         */
    __IM  uint32_t soc_flash_rdy : 1;         /*!< [5..5] 1: Flash ready                                                     */
    __IOM uint32_t soc_lpc_sram_ctrl_en : 1;  /*!< [6..6] 1: enable LPC-SRAM memory controller                               */
    __IOM uint32_t soc_lpc_phy_en : 1;        /*!< [7..7] 1: enable LPC-SRAM PHY                                             */
    __IOM uint32_t soc_cpu_en : 1;            /*!< [8..8] 1: enable CPU                                                      */
    __IM  uint32_t            : 4;
    __IOM uint32_t soc_gdma0_en : 1;          /*!< [13..13] 1: Enable GDMA block                                             */
    __IM  uint32_t            : 2;
    __IOM uint32_t soc_gtimer_en : 1;         /*!< [16..16] 1: enable HS GTIMER IP and GTIMER register                       */
    __IOM uint32_t soc_gtimer_int_clk_sel : 1;/*!< [17..17] 0: APB CLK; 1: TIMER CLK                                         */
    __IM  uint32_t            : 2;
    __IOM uint32_t soc_sec_eng_en : 1;        /*!< [20..20] 1: enable security engine IP                                     */
    __IM  uint32_t            : 3;
    __IOM uint32_t soc_flashdl_type : 2;      /*!< [25..24] SW used 0: FW write Flash 8Bytes every time, and erase
                                                   sector before write 1: FW write Flash 8Bytes every time,
                                                   not erase sector before write 2: FW write Flash 256Bytes
                                                   every time, not erase sector before write 3: RSVD                         */
    __IOM uint32_t ram_start_func : 2;        /*!< [27..26] SW used: RAM code startup function index                         */
    __IOM uint32_t sw_rsvd    : 2;            /*!< [29..28] Reserved for SW                                                  */
    __IOM uint32_t soc_wake_from_ps : 1;      /*!< [30..30] Indicates the status of fast booting                             */
    __IOM uint32_t soc_boot_from_jtag : 1;    /*!< [31..31] SW used                                                          */
  } b;                                        /*!< bit fields for syson_soc_func_en */
} syson_soc_func_en_t, *psyson_soc_func_en_t;

/**
  \brief Union type to access syson_soc_hci_com_func_en (@ 0x00000214).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000214) SOC HCI Function Enable Control Register                   */
  
  struct {
    __IOM uint32_t soc_hci_sdiod_on_en : 1;   /*!< [0..0] 1: enable SDIO device IP ON block                                  */
    __IOM uint32_t soc_hci_sdiod_off_en : 1;  /*!< [1..1] 1: enable SDIO device IP OFF block                                 */
    __IM  uint32_t            : 1;
    __IOM uint32_t soc_hci_sdiod_on_rst_mux : 1;/*!< [3..3] 1: Mask WDOG_RST to reset SDIO dev IP ON block                   */
    __IM  uint32_t            : 12;
    __IOM uint32_t soc_wl_macon_en : 1;       /*!< [16..16] 1: enable WLON and WL macro block                                */
    __IOM uint32_t soc_wlmac_rst_mux : 1;     /*!< [17..17] 1: Mask WDOG_RST to reset WLMAN ON block                         */
    __IOM uint32_t soc_wl_axi_en : 1;         /*!< [18..18] 1: enable WL AXI                                                 */
    __IM  uint32_t            : 5;
    __IOM uint32_t soc_bt_en  : 1;            /*!< [24..24] 1: Enale BT block; 0: Reset BT block                             */
    __IOM uint32_t soc_mem_access_right : 1;  /*!< [25..25] 1: switch memory access right to BT, memory clk switch
                                                   to 40Mhz                                                                  */
    __IOM uint32_t soc_mem_clk_en : 1;        /*!< [26..26] 1: enable share memory 60 MHz clk                                */
    __IOM uint32_t soc_jtag_mux_sel : 1;      /*!< [27..27] 1: Jtag switch to BT; 0: :default on SOC                         */
    __IOM uint32_t soc_bt_i2c_en : 1;         /*!< [28..28] 1: enable BT i2c interface mux                                   */
    __IOM uint32_t soc_bt_uart_pin_en : 1;    /*!< [29..29] 1: enable BT uart to pin                                         */
  } b;                                        /*!< bit fields for syson_soc_hci_com_func_en */
} syson_soc_hci_com_func_en_t, *psyson_soc_hci_com_func_en_t;

/**
  \brief Union type to access syson_soc_peri_func0_en (@ 0x00000218).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000218) SOC Peripheral Function Enable Control Register0           */
  
