pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t peri_uart0_en : 1;         /*!< [0..0] 1; enable UART0 interface                                          */
    __IOM uint32_t peri_uart1_en : 1;         /*!< [1..1] 1; enable UART1 interface                                          */
    __IOM uint32_t peri_uart2_en : 1;         /*!< [2..2] 1; enable UART2 interface                                          */
    __IOM uint32_t peri_uart3_en : 1;         /*!< [3..3] 1; enable UART3 interface                                          */
    __IOM uint32_t peri_uart0_wdgrst_mask : 1;/*!< [4..4] 1: Mask WDG reset uart0                                            */
    __IM  uint32_t            : 3;
    __IOM uint32_t peri_spi0_en : 1;          /*!< [8..8] 1: enable SPI0 interface                                           */
    __IM  uint32_t            : 7;
    __IOM uint32_t peri_i2c0_en : 1;          /*!< [16..16] 1: enable I2C0 interface                                         */
  } b;                                        /*!< bit fields for syson_soc_peri_func0_en */
} syson_soc_peri_func0_en_t, *psyson_soc_peri_func0_en_t;

/**
  \brief Union type to access syson_soc_peri_func1_en (@ 0x0000021C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000021C) SOC Peripheral Function Enable Control Register1           */
  
  struct {
    __IM  uint32_t            : 12;
    __IOM uint32_t pwm_en     : 1;            /*!< [12..12] 1: enable PWM function                                           */
    __IOM uint32_t pwm_int_clk_sel : 1;       /*!< [13..13] 0: APB CLK; 1: TIMER CLK                                         */
  } b;                                        /*!< bit fields for syson_soc_peri_func1_en */
} syson_soc_peri_func1_en_t, *psyson_soc_peri_func1_en_t;

/**
  \brief Union type to access syson_soc_peri_bd_func0_en (@ 0x00000220).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000220) SOC Peripheral Bus Domain Function Enable Control
                                                                  Register                                                   */
  
  struct {
    __IOM uint32_t peri_uart0_bd_en : 1;      /*!< [0..0] 1: enable UART0 bus domain                                         */
    __IOM uint32_t peri_uart1_bd_en : 1;      /*!< [1..1] 1: enable UART1 bus domain                                         */
    __IOM uint32_t peri_uart2_bd_en : 1;      /*!< [2..2] 1: enable UART2 bus domain                                         */
    __IOM uint32_t peri_uart3_bd_en : 1;      /*!< [3..3] 1: enable UART3 bus domain                                         */
  } b;                                        /*!< bit fields for syson_soc_peri_bd_func0_en */
} syson_soc_peri_bd_func0_en_t, *psyson_soc_peri_bd_func0_en_t;

/**
  \brief Union type to access syson_pesoc_clk_ctrl (@ 0x00000230).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000230) Peripheral Clock Enable Control Register                   */
  
  struct {
    __IM  uint32_t            : 2;
    __IOM uint32_t soc_cke_plfm : 1;          /*!< [2..2] 1: enable CPU platform clock                                       */
    __IM  uint32_t            : 3;
    __IOM uint32_t soc_pclk_vendor_reg_en : 1;/*!< [6..6] 1: enable vendor reg pclock                                        */
    __IM  uint32_t            : 1;
    __IOM uint32_t soc_clk_flash_en : 1;      /*!< [8..8] 1: enable flash spic_clk                                           */
    __IOM uint32_t soc_clk_lpcsram_en : 1;    /*!< [9..9] 1: enable LPC-SRAM clk                                             */
    __IOM uint32_t soc_clk_lpcsramphy_en : 1; /*!< [10..10] 1: enable LPC-SRAM phy_clk                                       */
    __IM  uint32_t            : 3;
    __IOM uint32_t soc_sclk_hstimer_en : 1;   /*!< [14..14] 1: enable timer clk_cnt                                          */
    __IOM uint32_t soc_pclk_hstimer_en : 1;   /*!< [15..15] 1: enable timer pclock                                           */
    __IOM uint32_t soc_clk_gdma0_en : 1;      /*!< [16..16] 1: enable gdma0 clock                                            */
    __IM  uint32_t            : 3;
    __IOM uint32_t soc_sclk_pwm_en : 1;       /*!< [20..20] 1: enable PWM clk_cnt                                            */
    __IOM uint32_t soc_pclk_pwm_en : 1;       /*!< [21..21] 1: enable PWM pclock                                             */
  } b;                                        /*!< bit fields for syson_pesoc_clk_ctrl */
} syson_pesoc_clk_ctrl_t, *psyson_pesoc_clk_ctrl_t;

/**
  \brief Union type to access syson_pesoc_peri_clk_ctrl0 (@ 0x00000234).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000234) Peripheral Clock Enable Control Register0                  */
  
  struct {
    __IOM uint32_t soc_sclk_uart0_en : 1;     /*!< [0..0] 1; enable UART0 sclock                                             */
    __IOM uint32_t soc_pclk_uart0_en : 1;     /*!< [1..1] 1; enable UART0 pclock                                             */
    __IOM uint32_t soc_sclk_uart1_en : 1;     /*!< [2..2] 1; enable UART1 sclock                                             */
    __IOM uint32_t soc_pclk_uart1_en : 1;     /*!< [3..3] 1; enable UART1 pclock                                             */
    __IOM uint32_t soc_sclk_uart2_en : 1;     /*!< [4..4] 1; enable UART2 sclock                                             */
    __IOM uint32_t soc_pclk_uart2_en : 1;     /*!< [5..5] 1; enable UART2 pclock                                             */
    __IOM uint32_t soc_sclk_uart3_en : 1;     /*!< [6..6] 1; enable UART3 sclock                                             */
    __IOM uint32_t soc_pclk_uart3_en : 1;     /*!< [7..7] 1; enable UART3 pclock                                             */
    __IM  uint32_t            : 8;
    __IOM uint32_t soc_sclk_spi0_en : 1;      /*!< [16..16] 1; enable SPI0 ssi_clk                                           */
    __IOM uint32_t soc_pclk_spi0_en : 1;      /*!< [17..17] 1; enable SPI0 pclock                                            */
  } b;                                        /*!< bit fields for syson_pesoc_peri_clk_ctrl0 */
} syson_pesoc_peri_clk_ctrl0_t, *psyson_pesoc_peri_clk_ctrl0_t;

/**
  \brief Union type to access syson_pesoc_peri_clk_ctrl1 (@ 0x00000238).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000238) Peripheral Clock Enable Control Register1                  */
  
