pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t soc_sclk_i2c0_en : 1;      /*!< [0..0] 1: enable I2C0 ic_clk                                              */
    __IOM uint32_t soc_pclk_i2c0_en : 1;      /*!< [1..1] 1; enable I2C0 pclock                                              */
  } b;                                        /*!< bit fields for syson_pesoc_peri_clk_ctrl1 */
} syson_pesoc_peri_clk_ctrl1_t, *psyson_pesoc_peri_clk_ctrl1_t;

/**
  \brief Union type to access syson_pesoc_hci_clk_ctrl0 (@ 0x00000240).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000240) Peripheral HCI Clock Enable Control Register               */
  
  struct {
    __IOM uint32_t soc_anaclk_sdio_dev_en : 1;/*!< [0..0] 1: enable SDIO_DEV ANA clock                                       */
    __IOM uint32_t soc_pclk_sdio_dev_en : 1;  /*!< [1..1] 1; enable SDIO_DEV H clock                                         */
  } b;                                        /*!< bit fields for syson_pesoc_hci_clk_ctrl0 */
} syson_pesoc_hci_clk_ctrl0_t, *psyson_pesoc_hci_clk_ctrl0_t;

/**
  \brief Union type to access syson_pesoc_com_clk_ctrl1 (@ 0x00000244).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000244) SOC Common Clock Enable Control Register                   */
  
  struct {
    __IOM uint32_t soc_wl_anaclk_en : 1;      /*!< [0..0] 1: enable WL ANA clock                                             */
    __IOM uint32_t soc_wl_axiclk_en : 1;      /*!< [1..1] 1: enable WL AXI clock                                             */
    __IOM uint32_t soc_wl_32k_en : 1;         /*!< [2..2] 1: enable WL 32K clock                                             */
    __IM  uint32_t            : 1;
    __IOM uint32_t soc_clk_security_eng_en : 1;/*!< [4..4] 1: enable security engine clock                                   */
    __IM  uint32_t            : 3;
    __IOM uint32_t soc_32kclk_bt_en : 1;      /*!< [8..8] 1: enable BT 32kHz clock                                           */
    __IOM uint32_t soc_40mclk_bt_en : 1;      /*!< [9..9] 1: enable BT 40MHz clock                                           */
  } b;                                        /*!< bit fields for syson_pesoc_com_clk_ctrl1 */
} syson_pesoc_com_clk_ctrl1_t, *psyson_pesoc_com_clk_ctrl1_t;

/**
  \brief Union type to access syson_pesoc_clk_sel (@ 0x00000250).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000250) Peripheral Clock Selection Register                        */
  
  struct {
    __IM  uint32_t            : 16;
    __IOM uint32_t pesoc_ck_scale : 2;        /*!< [17..16] PLL clock divided by N: 2b'00: N=1, 2b'01: N=2 (/2),
                                                   2b'02: N=4 (/4)                                                           */
  } b;                                        /*!< bit fields for syson_pesoc_clk_sel */
} syson_pesoc_clk_sel_t, *psyson_pesoc_clk_sel_t;

/**
  \brief Union type to access syson_pesoc_peri_ctrl (@ 0x00000308).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000308) SOC Peripheral Control Register                            */
  
  struct {
    __IM  uint32_t            : 8;
    __IOM uint32_t soc_func_spi_rn : 1;       /*!< [8..8] 1: master 0: slave                                                 */
  } b;                                        /*!< bit fields for syson_pesoc_peri_ctrl */
} syson_pesoc_peri_ctrl_t, *psyson_pesoc_peri_ctrl_t;

/**
  \brief Union type to access syson_rm_cfg0 (@ 0x00000320).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000320) Read Margin Configuration Register0                        */
  
  struct {
    __IOM uint32_t rm_synopsys_platform_120 : 4;/*!< [3..0] read margins                                                     */
    __IOM uint32_t rm_synopsys_bt_40 : 4;     /*!< [7..4] read margins                                                       */
    __IOM uint32_t rm_synopsys_wlbb_80 : 4;   /*!< [11..8] read margins                                                      */
    __IOM uint32_t rm_synopsys_wlbb_160 : 4;  /*!< [15..12] read margins                                                     */
    __IOM uint32_t rm_rtk_platform_120 : 4;   /*!< [19..16] read margins                                                     */
    __IOM uint32_t rm_rtk_dtcm_120 : 4;       /*!< [23..20] read margins                                                     */
    __IOM uint32_t rm_synopsys_wlmac_40 : 4;  /*!< [27..24] read margins                                                     */
    __IOM uint32_t rm_synopsys_wlmac_160 : 4; /*!< [31..28] read margin of wlamac 160hz memory.                              */
  } b;                                        /*!< bit fields for syson_rm_cfg0 */
} syson_rm_cfg0_t, *psyson_rm_cfg0_t;

/**
  \brief Union type to access syson_rm_cfg1 (@ 0x00000324).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000324) Read Margin Configuration Register1                        */
  
  struct {
    __IOM uint32_t rm_synopsys_wlmac_60 : 4;  /*!< [3..0] read margins                                                       */
    __IOM uint32_t rm_synopsys_sdio : 4;      /*!< [7..4] read margins                                                       */
    __IOM uint32_t rm_synopsys_share : 4;     /*!< [11..8] read margins                                                      */
    __IOM uint32_t rm_synopsys_bt_rom : 4;    /*!< [15..12] read margins                                                     */
    __IOM uint32_t rm_synopsys_itcm_rom : 4;  /*!< [19..16] read margins                                                     */
    __IOM uint32_t rm_synopsys_wmac_rom : 4;  /*!< [23..20] read margins                                                     */
  } b;                                        /*!< bit fields for syson_rm_cfg1 */
} syson_rm_cfg1_t, *psyson_rm_cfg1_t;

/**
  \brief Union type to access syson_rme_cfg (@ 0x00000328).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000328) Read Margin Enable Configuration Register                  */
  
