pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_syson_type.h
  struct {
    __IOM uint32_t rme_synopsys_platform_120 : 1;/*!< [0..0] rme_synopsys_platform_120                                       */
    __IOM uint32_t rme_synopsys_bt_80 : 1;    /*!< [1..1] rme_synopsys_bt_80                                                 */
    __IOM uint32_t rme_synopsys_wlbb_80 : 1;  /*!< [2..2] rme_synopsys_wlbb_80                                               */
    __IOM uint32_t rme_synopsys_wlbb_160 : 1; /*!< [3..3] rme_synopsys_wlbb_160                                              */
    __IOM uint32_t saw_rtk_platform_120 : 2;  /*!< [5..4] saw_rtk_platform_120                                               */
    __IOM uint32_t saw_rtk_dtcm_120 : 2;      /*!< [7..6] saw_rtk_dtcm_120                                                   */
    __IOM uint32_t rme_synopsys_wlmac_40 : 1; /*!< [8..8] rme_synopsys_wlmac_40                                              */
    __IOM uint32_t rme_synopsys_wlmac_160 : 1;/*!< [9..9] rme_synopsys_wlmac_160                                             */
    __IOM uint32_t rme_synopsys_wlmac_60 : 1; /*!< [10..10] rme_synopsys_wlmac_60                                            */
    __IOM uint32_t rme_synopsys_sdio : 1;     /*!< [11..11] rme_synopsys_sdio                                                */
    __IOM uint32_t rme_synopsys_share : 1;    /*!< [12..12] rme_synopsys_share                                               */
    __IOM uint32_t rme_synopsys_bt_rom : 1;   /*!< [13..13] rme_synopsys_bt_rom                                              */
    __IOM uint32_t rme_synopsys_itcm_rom : 1; /*!< [14..14] rme_synopsys_itcm_rom                                            */
    __IOM uint32_t rme_synopsys_wlmac_rom : 1;/*!< [15..15] rme_synopsys_wlmac_rom                                           */
  } b;                                        /*!< bit fields for syson_rme_cfg */
} syson_rme_cfg_t, *psyson_rme_cfg_t;

/**
  \brief Union type to access syson_peon_status (@ 0x000003F4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000003F4) Peripheral On Status Register                              */
  
  struct {
    __IOM uint32_t peon_sdio_aldn : 1;        /*!< [0..0] 1: SDIO Config autoload done; 0: autoload not ready                */
  } b;                                        /*!< bit fields for syson_peon_status */
} syson_peon_status_t, *psyson_peon_status_t;

/** @} */ /* End of group hal_syson_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SYSON_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_SYSON_SYSON_TYPE_H_

